const TELEGRAM_BOT_USERNAME = process.env.TELEGRAM_BOT_USERNAME

export const CAPTION = `Скачано при помощи @${TELEGRAM_BOT_USERNAME}`

export const START_SENDING_MESSAGE = 'Принял. Отправляю 🚀'

export const HELLO_MESSAGE =
  `Привет👋` +
  `\n\nС моей помощью ты можешь получить любое видео из Triller / TikTok / Instagram без логотипов в самом лучшем качестве 😊`

export const HELLO_INSTRUCTION_MESSAGE =
  `\n\nЧтобы воспользоваться ботом, подпишись на меня в instagram и отправь мне свой instagram для проверки подписки 🙏` +
  `\nТем самым, ты поддержишь разработчика, который не спал ночь, чтобы создать меня 🐼`

export const HOW_TO_AUTH_MESSAGE =
  'Чтобы воспользоваться ботом, подпишись на меня в instagram и отправь мне свой instagram для проверки 🙏'

export const HOW_TO_USE_MESSAGE = `\n\nОтправь мне ссылку на видео, а я тебе в ответ видео без логотипов в наилучшем качестве 😉`

export const STOLEN_MESSAGE =
  `Извини, но кто-то использовал этот инстаграм до тебя 😱` + `\n\nЕсли это твой инстаграм, напиши мне: @the_cursedsoul` + `\n\nА если это не твой инстаграм и ты хочешь меня обмануть, то не надо так 😢`
